<template>
    <div class="container">
        <div class="row">
            <div class="col-lg-12">
                <div class="aboutContainer">
                    <h1>О нас</h1>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col-lg-12">
                <p class="about__text">
                    Тестовый проект <a href="https://vk.com/derpyhowes">Марка</a> и <a href="https://vk.com/lost_inn_dark">Паши</a>, вот наш репозиторий <a href="https://github.com/mar4elkin/Lamia_chan_web">github</a>.
                    Почему Lamia chan? Во первых референс в сторону <a href="https://dailylifewithamonstergirl.fandom.com/wiki/Miia#cite_note-Volume_1_Omakes-0">мии</a>, а во вторых проект написанн на <u>python</u> 🐍 django + vue js 
                    вот и все :-). Помощь приветствуется. <br> TODO:
                </p> 
                <p class="about__text">
                    <br> 1) <s>улучшить поиск (чтобы он искал не только по перым буквам) сделать проверку на последний элемент и сделать прокрутку</s> <a href="https://github.com/mar4elkin/Lamia_chan_web/commit/cf2ca7ca9faf953d0b868bf33018546d9b8c7ffc">done</a>
                    <br> 2) доделать главную страницу, а именно название
                    <br> 3) <s>релевантность манги по дате, остался фронт</s> <a href="https://github.com/mar4elkin/Lamia_chan_web/commit/3a9ce53f1a3a239fe2eed27e17ca5e0888e0cebe">done</a>
                    <br> 4) работа с пользователями, аунтификация и авторизация через api, остался фронт -- это будет тяжело
                    <br> 5) переделать страницу детального просмотра манги, в процессе
                    <br> 6) на странице чтения добавить проверку на последнию страницу и если она токова открыть следующею главу   
                    <br> 7) <s>на стронице чтения и детальный странице добавить главы в select и страницы </s>
                    <br> 8) Добавить систему оценки манги 
                    <br> 9) Добавить систему загрузки манги
                    <br> 10) Пофиксить баг на странице выбраного тегов и доверстать стрницу со всеми тэгами
                    <br> 11) начать делать приложения для ios и <a href="https://github.com/mar4elkin/lamia_chan_android">android</a>
                    
                </p> 
                
            </div>
        </div>
    </div>
</template>

<script>
export default {
    
}
</script>

<style scoped>
    .aboutContainer{
        text-align: center;
    }
</style>